Terraform plan prod:
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.stateless.module.bfd_pipeline.aws_cloudwatch_log_metric_filter.pipeline-messages-error-count will be created
  + resource "aws_cloudwatch_log_metric_filter" "pipeline-messages-error-count" {
      + id             = (known after apply)
      + log_group_name = "/bfd/prod/bfd-pipeline/messages.txt"
      + name           = "bfd-prod/bfd-pipeline/messages/count/error"
      + pattern        = "[date, time, java_thread, level = \"ERROR\", java_class, message]"

      + metric_transformation {
          + default_value = "0"
          + name          = "messages/count/error"
          + namespace     = "bfd-prod/bfd-pipeline"
          + value         = "1"
        }
    }

  # module.stateless.module.bfd_pipeline.aws_cloudwatch_metric_alarm.pipeline-messages-error will be created
  + resource "aws_cloudwatch_metric_alarm" "pipeline-messages-error" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-alarms",
        ]
      + alarm_description                     = "Pipeline errors detected within 300 seconds in APP-ENV: bfd-prod"
      + alarm_name                            = "bfd-prod-pipeline-messages-error"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "messages/count/error"
      + namespace                             = "bfd-prod/bfd-pipeline"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-ok",
        ]
      + period                                = 300
      + statistic                             = "Maximum"
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```